{"keras_version": "1.2.2", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 408, 440, 3], "input_dtype": "float32", "name": "input_1"}}, {"name": "zeropadding2d_1", "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"trainable": true, "name": "zeropadding2d_1", "padding": [4, 4]}}, {"name": "convolution2d_1", "class_name": "Convolution2D", "inbound_nodes": [[["zeropadding2d_1", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_1", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 16}}, {"name": "leakyrelu_1", "class_name": "LeakyReLU", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_1", "alpha": 0.3}}, {"name": "convolution2d_2", "class_name": "Convolution2D", "inbound_nodes": [[["leakyrelu_1", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_2", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 16}}, {"name": "leakyrelu_2", "class_name": "LeakyReLU", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_2", "alpha": 0.3}}, {"name": "convolution2d_3", "class_name": "Convolution2D", "inbound_nodes": [[["leakyrelu_2", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_3", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 16}}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"name": "batchnormalization_1", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_3", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_3", "alpha": 0.3}}, {"name": "convolution2d_4", "class_name": "Convolution2D", "inbound_nodes": [[["leakyrelu_3", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_4", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 16}}, {"name": "batchnormalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"name": "batchnormalization_2", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_4", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_4", "alpha": 0.3}}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["leakyrelu_4", 0, 0]]], "config": {"name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"name": "convolution2d_5", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_5", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"name": "batchnormalization_3", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_5", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_5", "alpha": 0.3}}, {"name": "convolution2d_6", "class_name": "Convolution2D", "inbound_nodes": [[["leakyrelu_5", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_6", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"name": "batchnormalization_4", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_6", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_6", "alpha": 0.3}}, {"name": "convolution2d_7", "class_name": "Convolution2D", "inbound_nodes": [[["leakyrelu_6", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_7", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"name": "batchnormalization_5", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_7", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_7", "alpha": 0.3}}, {"name": "upsampling2d_1", "class_name": "UpSampling2D", "inbound_nodes": [[["leakyrelu_7", 0, 0]]], "config": {"trainable": true, "name": "upsampling2d_1", "size": [2, 2]}}, {"name": "convolution2d_8", "class_name": "Convolution2D", "inbound_nodes": [[["upsampling2d_1", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_8", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"name": "batchnormalization_6", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_8", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_6", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_8", "alpha": 0.3}}, {"name": "merge_1", "class_name": "Merge", "inbound_nodes": [[["leakyrelu_8", 0, 0], ["leakyrelu_4", 0, 0]]], "config": {"name": "merge_1", "concat_axis": 3, "output_mask": null, "mode_type": "raw", "output_shape": null, "output_mask_type": "raw", "mode": "concat", "output_shape_type": "raw", "arguments": {}, "dot_axes": -1}}, {"name": "maxpooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"name": "convolution2d_9", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_9", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "config": {"name": "batchnormalization_7", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_9", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_7", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_9", "alpha": 0.3}}, {"name": "convolution2d_10", "class_name": "Convolution2D", "inbound_nodes": [[["leakyrelu_9", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_10", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "config": {"name": "batchnormalization_8", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_10", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_8", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_10", "alpha": 0.3}}, {"name": "convolution2d_11", "class_name": "Convolution2D", "inbound_nodes": [[["leakyrelu_10", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_11", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_9", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_11", 0, 0]]], "config": {"name": "batchnormalization_9", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_11", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_9", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_11", "alpha": 0.3}}, {"name": "upsampling2d_2", "class_name": "UpSampling2D", "inbound_nodes": [[["leakyrelu_11", 0, 0]]], "config": {"trainable": true, "name": "upsampling2d_2", "size": [2, 2]}}, {"name": "convolution2d_12", "class_name": "Convolution2D", "inbound_nodes": [[["upsampling2d_2", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_12", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_10", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_12", 0, 0]]], "config": {"name": "batchnormalization_10", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_12", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_10", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_12", "alpha": 0.3}}, {"name": "merge_2", "class_name": "Merge", "inbound_nodes": [[["leakyrelu_12", 0, 0], ["leakyrelu_4", 0, 0]]], "config": {"name": "merge_2", "concat_axis": 3, "output_mask": null, "mode_type": "raw", "output_shape": null, "output_mask_type": "raw", "mode": "concat", "output_shape_type": "raw", "arguments": {}, "dot_axes": -1}}, {"name": "maxpooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["merge_2", 0, 0]]], "config": {"name": "maxpooling2d_3", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"name": "convolution2d_13", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_13", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_11", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_13", 0, 0]]], "config": {"name": "batchnormalization_11", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_13", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_11", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_13", "alpha": 0.3}}, {"name": "convolution2d_14", "class_name": "Convolution2D", "inbound_nodes": [[["leakyrelu_13", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_14", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_12", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_14", 0, 0]]], "config": {"name": "batchnormalization_12", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_14", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_12", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_14", "alpha": 0.3}}, {"name": "convolution2d_15", "class_name": "Convolution2D", "inbound_nodes": [[["leakyrelu_14", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_15", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_13", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_15", 0, 0]]], "config": {"name": "batchnormalization_13", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_15", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_13", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_15", "alpha": 0.3}}, {"name": "upsampling2d_3", "class_name": "UpSampling2D", "inbound_nodes": [[["leakyrelu_15", 0, 0]]], "config": {"trainable": true, "name": "upsampling2d_3", "size": [2, 2]}}, {"name": "convolution2d_16", "class_name": "Convolution2D", "inbound_nodes": [[["upsampling2d_3", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_16", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_14", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_16", 0, 0]]], "config": {"name": "batchnormalization_14", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_16", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_14", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_16", "alpha": 0.3}}, {"name": "merge_3", "class_name": "Merge", "inbound_nodes": [[["leakyrelu_16", 0, 0], ["leakyrelu_4", 0, 0]]], "config": {"name": "merge_3", "concat_axis": 3, "output_mask": null, "mode_type": "raw", "output_shape": null, "output_mask_type": "raw", "mode": "concat", "output_shape_type": "raw", "arguments": {}, "dot_axes": -1}}, {"name": "maxpooling2d_4", "class_name": "MaxPooling2D", "inbound_nodes": [[["merge_3", 0, 0]]], "config": {"name": "maxpooling2d_4", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"name": "convolution2d_17", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_4", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_17", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_15", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_17", 0, 0]]], "config": {"name": "batchnormalization_15", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_17", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_15", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_17", "alpha": 0.3}}, {"name": "convolution2d_18", "class_name": "Convolution2D", "inbound_nodes": [[["leakyrelu_17", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_18", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_16", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_18", 0, 0]]], "config": {"name": "batchnormalization_16", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_18", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_16", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_18", "alpha": 0.3}}, {"name": "convolution2d_19", "class_name": "Convolution2D", "inbound_nodes": [[["leakyrelu_18", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_19", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_17", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_19", 0, 0]]], "config": {"name": "batchnormalization_17", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_19", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_17", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_19", "alpha": 0.3}}, {"name": "upsampling2d_4", "class_name": "UpSampling2D", "inbound_nodes": [[["leakyrelu_19", 0, 0]]], "config": {"trainable": true, "name": "upsampling2d_4", "size": [2, 2]}}, {"name": "convolution2d_20", "class_name": "Convolution2D", "inbound_nodes": [[["upsampling2d_4", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "same", "name": "convolution2d_20", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"name": "batchnormalization_18", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_20", 0, 0]]], "config": {"name": "batchnormalization_18", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_20", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_18", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_20", "alpha": 0.3}}, {"name": "merge_4", "class_name": "Merge", "inbound_nodes": [[["leakyrelu_20", 0, 0], ["leakyrelu_4", 0, 0]]], "config": {"name": "merge_4", "concat_axis": 3, "output_mask": null, "mode_type": "raw", "output_shape": null, "output_mask_type": "raw", "mode": "concat", "output_shape_type": "raw", "arguments": {}, "dot_axes": -1}}, {"name": "convolution2d_21", "class_name": "Convolution2D", "inbound_nodes": [[["merge_4", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "valid", "name": "convolution2d_21", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 32}}, {"name": "batchnormalization_19", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_21", 0, 0]]], "config": {"name": "batchnormalization_19", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_21", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_19", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_21", "alpha": 0.3}}, {"name": "convolution2d_22", "class_name": "Convolution2D", "inbound_nodes": [[["leakyrelu_21", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "valid", "name": "convolution2d_22", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 32}}, {"name": "batchnormalization_20", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_22", 0, 0]]], "config": {"name": "batchnormalization_20", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_22", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_20", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_22", "alpha": 0.3}}, {"name": "convolution2d_23", "class_name": "Convolution2D", "inbound_nodes": [[["leakyrelu_22", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "valid", "name": "convolution2d_23", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 32}}, {"name": "batchnormalization_21", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_23", 0, 0]]], "config": {"name": "batchnormalization_21", "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "leakyrelu_23", "class_name": "LeakyReLU", "inbound_nodes": [[["batchnormalization_21", 0, 0]]], "config": {"trainable": true, "name": "leakyrelu_23", "alpha": 0.3}}, {"name": "convolution2d_24", "class_name": "Convolution2D", "inbound_nodes": [[["leakyrelu_23", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "valid", "name": "convolution2d_24", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 1}}, {"name": "convolution2d_25", "class_name": "Convolution2D", "inbound_nodes": [[["leakyrelu_23", 0, 0]]], "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "valid", "name": "convolution2d_25", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 1}}, {"name": "area", "class_name": "Activation", "inbound_nodes": [[["convolution2d_24", 0, 0]]], "config": {"trainable": true, "name": "area", "activation": "sigmoid"}}, {"name": "edge", "class_name": "Activation", "inbound_nodes": [[["convolution2d_25", 0, 0]]], "config": {"trainable": true, "name": "edge", "activation": "sigmoid"}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["area", 0, 0], ["edge", 0, 0]]}}